{
  "education": [
    {
      "year": "2022 - Present",
      "institution": "Global Institute Of Technology, Jaipur",
      "degree": "B.Tech",
      "description": "In my third year of pursuing a B.Tech degree in Computer Science and Engineering at my college life, I have developed a deep understanding of various computer science topics, including programming, algorithms, data structures, database management, and web development."
    },
    {
      "year": "2009 - 2021",
      "institution": "Shri Trilok Bharti Public Sr. Sec. School",
      "degree": "1st - 11th",
      "description": "It is a place where we not only gain academic knowledge but also learn the values of discipline, teamwork, respect, and responsibility. School is where dreams begin to form — in classrooms, on the playground, and during morning assemblies."
    },
    {
      "year": "2021 - 2022",
      "institution": "Hansraj Memorial public school",
      "degree": "12th",
      "description": "At my 12th class, I pursued studies in the science stream, benefiting from a comprehensive education that equipped me with the necessary skills and knowledge for my academic and professional endeavors ahead."
    }
  ],
  "experience": [
    {
      "year": "July 2024 - Oct. 2024",
      "position": "Web Development and real-time project training",
      "company": "NullClass Pvt. Ltd.",
      "description": "NullClass Pvt. Ltd. Offers hands‑on learning through real-life projects. They provide 24/7 mentor support via platforms like WhatsApp to help learners build and operate real-time applications — aiming to bridge the gap between academic knowledge and industry‑ready skills "
    },
    {
      "year": "July 2024 - Oct. 2024",
      "position": "Full Stack Web Development",
      "company": "Upflairs Pvt. Ltd.",
      "description": "As part of Upflairs Pvt. Ltd., I play a key role in developing and managing projects related to Computer Science and Engineering courses. Serving as a Full Stack Web Development, craft intuitive interfaces, manage project timelines, and present our work at national IT festivals, showcasing our team's accomplishments and fostering industry collaboration."
    },
    {
      "year": "04/11/2023 - 09/11/2023",
      "position": "Kabaddi Tournament",
      "company": "All india kabaddi federation",
      "description": "Represented Rajasthan Technical University, Kota in Kabaddi for the year 2023-24 season as a player and participated in West Zone All India Inter University Kabaddi Tournament held at D.A.V Indore and Secured 12th position in the tournament."
    }
  ]
}
