[
  {
    "name": "School Website",
    "description": "A modern and responsive school website designed to showcase academic excellence, facilities, admissions, and connect parents, students, and staff seamlessly.",
    "image": "School.png",
    "link": "https://github.com/lakshay94132/STBP-Sr.-Sec.-School"
  },
  {
    "name": "Library Website",
    "description": "A clean and user-friendly library website that provides access to books, digital resources, membership details, and promotes a culture of reading and learning.",
    "image": "Library.png",
    "link": "https://github.com/lakshay94132/MLD-LIBRARY"
  },
  {
    "name": "iNoteBook",
    "description": "A digital notebook web application designed to securely store, edit, and manage personal notes online with user authentication and cloud-based access.",
    "image": "iNoteBook.png",
    "link": "https://github.com/lakshay94132/inotebook"
  },
  {
    "name": "NewsMonkey",
    "description": "A real-time news web application that fetches the latest headlines across various categories using APIs, delivering fast and categorized news updates to users.",
    "image": "NewsMonkey.png",
    "link": "https://github.com/lakshay94132/NewsMonkey"
  },
  {
    "name": "TextUtils",
    "description": "A simple and efficient text utility web app that allows users to analyze, modify, and format text with features like word count, case conversion, and extra space removal.",
    "image": "TextUtils.png",
    "link": "https://github.com/lakshay94132/TextUtils"
  },
  {
    "name": "B.Tech RTU Notes",
    "description": "A dedicated website built for B.Tech students under RTU, offering well-organized, easy-to-access semester-wise notes and study materials for exam preparation.",
    "image": "Notes.png",
    "link": "https://github.com/lakshay94132/B.Tech-RTU-Notes"
  },
  {
    "name": "ToDos List",
    "description": "A responsive To-Do List web app that helps users add, manage, and delete daily tasks efficiently, enhancing productivity and task tracking.",
    "image": "ToDo.png",
    "link": "https://github.com/lakshay94132/todos-list"
  },
  {
    "name": "Tic Tac Toe Game",
    "description": "A classic Tic Tac Toe game built using web technologies, offering an interactive and fun way for two players to compete with a simple and responsive interface.",
    "image": "TTT.png",
    "link": "https://github.com/lakshay94132/Tic-Tac-Toe-Game"
  },
  {
    "name": "PortFolio",
    "description": "A personal portfolio website showcasing skills, projects, and achievements, designed to reflect individuality and professionalism for academic or career opportunities.",
    "image": "Lakshay.png",
    "link": "https://github.com/lakshay94132/Portfolio"
  },
  {
    "name": "E-Commerce",
    "description": "A dynamic e-commerce website that allows users to browse products, add items to a cart, and place orders—featuring a clean UI and secure shopping experience.",
    "image": "E.png",
    "link": "https://github.com/lakshay94132/E-Commerce"
  },
  {
    "name": "Rock-Paper-Scissors-Game",
    "description": "An interactive Rock-Paper-Scissors game built with simple logic and animations, allowing users to play against the computer in a fun and engaging way.",
    "image": "RPS.jpeg",
    "link": "https://github.com/lakshay94132/Rock-Paper-Scissors-Game"
  },
  {
    "name": "Task-Management-System",
    "description": "A web-based Task Management System designed to create, assign, track, and update tasks efficiently—ideal for improving team productivity and project organization.",
    "image": "TMS.jpeg",
    "link": "https://github.com/lakshay94132/Task-Management-System"
  }
]
